aws/amazon-freertos/lib/third_party/mcu_vendor/renesas/FIT/RDP_v1.15_modified/r_sci_iic_rx/src/targets/rx64m/r_sci_iic_rx64m.c
    #if SCI_IIC_CFG_CH3_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch3_rom =
{
    BSP_LOCK_SCI3,
    (sci_regs_t)&SCI3,
    &SYSTEM.MSTPCRB.LONG, BIT28_MASK,
    &ICU.IPR[IPR_SCI3_TXI3].BYTE,
    &ICU.IR[IR_SCI3_TXI3].BYTE,
    &ICU.GRPBL0.LONG, BIT6_MASK,
    &ICU.IER[IER_SCI3_TXI3].BYTE, BIT1_MASK,
    &ICU.GENBL0.LONG, BIT6_MASK,
    BSP_INT_SRC_BL0_SCI3_TEI3,
    sci_iic_int_sci_iic3_tei_isr,
    SCI_IIC_CFG_CH3_INT_PRIORITY,
    SCI_IIC_CFG_CH3_SSCL_GP,
    SCI_IIC_CFG_CH3_SSCL_PIN,
    SCI_IIC_MPC_SSCL3_ENABLE,
    SCI_IIC_CFG_CH3_SSDA_GP,
    SCI_IIC_CFG_CH3_SSDA_PIN,
    SCI_IIC_MPC_SSDA3_ENABLE,
    SCI_IIC_CFG_CH3_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH3_BITRATE_BPS,
    SCI_IIC_CFG_CH3_DIGITAL_FILTER,
    SCI_IIC_CFG_CH3_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch3_ctrl =
{
    &g_sci_iic_ch3_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH4_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch4_rom =
{
    BSP_LOCK_SCI4,
    (sci_regs_t)&SCI4,
    &SYSTEM.MSTPCRB.LONG, BIT27_MASK,
    &ICU.IPR[IPR_SCI4_TXI4].BYTE,
    &ICU.IR[IR_SCI4_TXI4].BYTE,
    &ICU.GRPBL0.LONG, BIT8_MASK,
    &ICU.IER[IER_SCI4_TXI4].BYTE, BIT3_MASK,
    &ICU.GENBL0.LONG, BIT8_MASK,
    BSP_INT_SRC_BL0_SCI4_TEI4,
    sci_iic_int_sci_iic4_tei_isr,
    SCI_IIC_CFG_CH4_INT_PRIORITY,
    SCI_IIC_CFG_CH4_SSCL_GP,
    SCI_IIC_CFG_CH4_SSCL_PIN,
    SCI_IIC_MPC_SSCL4_ENABLE,
    SCI_IIC_CFG_CH4_SSDA_GP,
    SCI_IIC_CFG_CH4_SSDA_PIN,
    SCI_IIC_MPC_SSDA4_ENABLE,
    SCI_IIC_CFG_CH4_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH4_BITRATE_BPS,
    SCI_IIC_CFG_CH4_DIGITAL_FILTER,
    SCI_IIC_CFG_CH4_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch4_ctrl =
{
    &g_sci_iic_ch4_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH5_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch5_rom =
{
    BSP_LOCK_SCI5,
    (sci_regs_t)&SCI5,
    &SYSTEM.MSTPCRB.LONG, BIT26_MASK,
    &ICU.IPR[IPR_SCI5_TXI5].BYTE,
    &ICU.IR[IR_SCI5_TXI5].BYTE,
    &ICU.GRPBL0.LONG, BIT10_MASK,
    &ICU.IER[IER_SCI5_TXI5].BYTE, BIT5_MASK,
    &ICU.GENBL0.LONG, BIT10_MASK,
    BSP_INT_SRC_BL0_SCI5_TEI5,
    sci_iic_int_sci_iic5_tei_isr,
    SCI_IIC_CFG_CH5_INT_PRIORITY,
    SCI_IIC_CFG_CH5_SSCL_GP,
    SCI_IIC_CFG_CH5_SSCL_PIN,
    SCI_IIC_MPC_SSCL5_ENABLE,
    SCI_IIC_CFG_CH5_SSDA_GP,
    SCI_IIC_CFG_CH5_SSDA_PIN,
    SCI_IIC_MPC_SSDA5_ENABLE,
    SCI_IIC_CFG_CH5_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH5_BITRATE_BPS,
    SCI_IIC_CFG_CH5_DIGITAL_FILTER,
    SCI_IIC_CFG_CH5_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch5_ctrl =
{
    &g_sci_iic_ch5_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH6_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch6_rom =
{
    BSP_LOCK_SCI6,
    (sci_regs_t)&SCI6,
    &SYSTEM.MSTPCRB.LONG, BIT25_MASK,
    &ICU.IPR[IPR_SCI6_TXI6].BYTE,
    &ICU.IR[IR_SCI6_TXI6].BYTE,
    &ICU.GRPBL0.LONG, BIT12_MASK,
    &ICU.IER[IER_SCI6_TXI6].BYTE, BIT7_MASK,
    &ICU.GENBL0.LONG, BIT12_MASK,
    BSP_INT_SRC_BL0_SCI6_TEI6,
    sci_iic_int_sci_iic6_tei_isr,
    SCI_IIC_CFG_CH6_INT_PRIORITY,
    SCI_IIC_CFG_CH6_SSCL_GP,
    SCI_IIC_CFG_CH6_SSCL_PIN,
    SCI_IIC_MPC_SSCL6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_GP,
    SCI_IIC_CFG_CH6_SSDA_PIN,
    SCI_IIC_MPC_SSDA6_ENABLE,
    SCI_IIC_CFG_CH6_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH6_BITRATE_BPS,
    SCI_IIC_CFG_CH6_DIGITAL_FILTER,
    SCI_IIC_CFG_CH6_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch6_ctrl =
{
    &g_sci_iic_ch6_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH7_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch7_rom =
{
    BSP_LOCK_SCI7,
    (sci_regs_t)&SCI7,
    &SYSTEM.MSTPCRB.LONG, BIT24_MASK,
    &ICU.IPR[IPR_SCI7_TXI7].BYTE,
    &ICU.IR[IR_SCI7_TXI7].BYTE,
    &ICU.GRPBL0.LONG, BIT14_MASK,
    &ICU.IER[IER_SCI7_TXI7].BYTE, BIT3_MASK,
    &ICU.GENBL0.LONG, BIT14_MASK,
    BSP_INT_SRC_BL0_SCI7_TEI7,
    sci_iic_int_sci_iic7_tei_isr,
    SCI_IIC_CFG_CH7_INT_PRIORITY,
    SCI_IIC_CFG_CH7_SSCL_GP,
    SCI_IIC_CFG_CH7_SSCL_PIN,
    SCI_IIC_MPC_SSCL7_ENABLE,
    SCI_IIC_CFG_CH7_SSDA_GP,
    SCI_IIC_CFG_CH7_SSDA_PIN,
    SCI_IIC_MPC_SSDA7_ENABLE,
    SCI_IIC_CFG_CH7_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH7_BITRATE_BPS,
    SCI_IIC_CFG_CH7_DIGITAL_FILTER,
    SCI_IIC_CFG_CH7_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch7_ctrl =
{
    &g_sci_iic_ch7_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH12_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch12_rom =
{
    BSP_LOCK_SCI12,
    (sci_regs_t)&SCI12,
    &SYSTEM.MSTPCRB.LONG, BIT4_MASK,
    &ICU.IPR[IPR_SCI12_TXI12].BYTE,
    &ICU.IR[IR_SCI12_TXI12].BYTE,
    &ICU.GRPBL0.LONG, BIT16_MASK,
    &ICU.IER[IER_SCI12_TXI12].BYTE, BIT5_MASK,
    &ICU.GENBL0.LONG, BIT16_MASK,
    BSP_INT_SRC_BL0_SCI12_TEI12,
    sci_iic_int_sci_iic12_tei_isr,
    SCI_IIC_CFG_CH12_INT_PRIORITY,
    SCI_IIC_CFG_CH12_SSCL_GP,
    SCI_IIC_CFG_CH12_SSCL_PIN,
    SCI_IIC_MPC_SSCL12_ENABLE,
    SCI_IIC_CFG_CH12_SSDA_GP,
    SCI_IIC_CFG_CH12_SSDA_PIN,
    SCI_IIC_MPC_SSDA12_ENABLE,
    SCI_IIC_CFG_CH12_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH12_BITRATE_BPS,
    SCI_IIC_CFG_CH12_DIGITAL_FILTER,
    SCI_IIC_CFG_CH12_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch12_ctrl =
{
    &g_sci_iic_ch12_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)NULL,
    (sci_iic_info_t *)NULL
};
    #endif

